// TestForMatrix.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
    int matrix[11][11] = {
        {0, 17, 29, 24, 26, 27, 19, 21, 15, 19, 21},
        {25, 0, 20, 18, 17, 27, 29, 15, 15, 22, 18},
        {19, 30, 0, 22, 28, 16, 22, 18, 24, 28, 20},
        {25, 30, 17, 0, 27, 29, 21, 26, 24, 29, 19},
        {21, 29, 28, 27, 0, 27, 15, 21, 17, 23, 20},
        {17, 20, 16, 15, 20, 0, 16, 17, 22, 29, 20},
        {29, 26, 17, 16, 22, 24, 0, 28, 26, 16, 30},
        {23, 29, 21, 24, 24, 18, 21, 0, 22, 16, 25},
        {17, 17, 22, 29, 22, 15, 17, 20, 0, 30, 19},
        {15, 19, 16, 21, 23, 28, 15, 15, 25, 0, 28},
        {17, 17, 18, 27, 17, 15, 27, 21, 15, 29, 0}
    };
    for (int i = 0; i < 11; i++) {
        for (int j = i + 1; j < 11; j++) {
            swap(matrix[i][j], matrix[j][i]); // замена чисел относительно главной диагонали
        }
    }

    for (int i = 0; i < 11; i++) {
        for (int j = 0; j < 11 - i; j++) {
            swap(matrix[i][j], matrix[10 - j][10 - i]); // зеркальное отражение относительно главной диагонали
        }
    }

    for (int i = 0; i < 11; i++) {
        for (int j = 0; j < 11; j++) {
            cout << matrix[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}


